#ifndef __CAMERA_H__
#define __CAMERA_H__
#define M_PI 3.14159265358979323846
#define M_PI_2 1.57079632679489661923
#include <bits/stdc++.h>
#include "Point.h"
#include "Elevator.h"
struct Wall {
	Point min;//النقطة السفلية اليسرى الأمامية 
	Point max;//النقطة العلوية اليمنى الخلفية 
};

class Camera
{
public:
	Camera() { Init(); }
	~Camera() {}

	void Init();
	void Refresh();
	void SetPos(float x, float y, float z);
	void GetPos(float& x, float& y, float& z);
	void GetDirectionVector(float& x, float& y, float& z);
	void SetYaw(float angle);
	void SetPitch(float angle);
	bool CheckCollision(const Point& newPos);
	bool CheckDoorCollision(const Point& newPos);
	// Navigation
	void Move(float incr);
	void Strafe(float incr);
	void Fly(float incr);
	void RotateYaw(float angle);
	void RotatePitch(float angle);

	std::vector<Door*> Doors;
	std::vector<Door*> ElevetorDoors;
	std::vector<Wall> doorWalls{
		{Point(151.668,11.6564,-32.3706),Point(157.606,35.3446,-19.1159)},//باب القهوة 
		{Point(152.047,10.9798,-215.768),Point(156.397,35.7965,-199.091)},//باب المطعم
		{Point(149.778,62.9049,-217.012),Point(156.153,81.8947,-182.943)},//باب محل المفروشات 
		{Point(62.9383,64.1552,-290.832),Point(81.5989,86.886,-284.535)},//الباب العلوي للمصعد 
		{Point(61.9921,14.1143,-290.856),Point(82.2069,38.8347,-284.184)},//الباب الارضي للمصعد  
		{Point(53.5618,61.0225,-216),Point(59.9524,82.0314,-158.843)},//باب تبع محل الجوالات 
		{Point(54.2943,64.4303,-103.273),Point(58.1673,81.9693,-92.163)},//باب تبع صالة الكانتر 
		{Point(54.2937,64.3233,-36.0637),Point(59.4502,82.2379,-25.0383)},//باب تبع محل اللابتوبات
	};

	std::vector<Wall> walls = {
		//elevetor 
		{Point(53.7187,13.8136,-311.681),Point(59.2665,85.6306,-289.829)},//الحيط اليساري للمصعد
		{Point(84.4421,13.1857,-310.756),Point(90.2334,88.2544,-287)},//الحيط اليميني للمصعد 
		{Point(59.1949,37.8423,-289.807),Point(83.521,63.76,-286.235)},//الحيط يلي بين البابين تبع المصعد 
		{Point(57.4374,13.6611,-290.632),Point(62.843,88.0452,-286.245)},//الحيط الجانبي اليساري 
		{Point(81.1919,13.2107,-289.19),Point(88.2746,88.1276,-285.033)},//الحيط الجانبي اليميني للمصعد
		{Point(58.3459,59.9836,-285.476),Point(82.2744,64.4895,-215.661)},//الممر يلي عند المصعد
		{Point(57.181,61.3965,-285.839),Point(62.342,77.2581,-213.993)},//القزاز اليساري يلي بالممر تبع المصعد 
		{Point(82.228,65.6303,-284.515),Point(87.9991,76.6853,-211.423)},//القزاز اليميني يلي بالممر تبع المصعد
		{Point(86.7532,61.9339,-217.528),Point(127.681,78.4771,-211.001)},//
		
		// mall 
		{Point(-7.20473,2.10463,-326.21),Point(218.896,13.067,2.14833)},//الرصيف يلي تحت ارضية المول 
		{Point(150.905,62.1459,-190.26),Point(156.874,81.5486,-183.352)},//الحيط يلي على يسار باب المفروشات 
		{Point(149.778,62.9049,-217.012),Point(156.775,80.8625,-209.733)},//الحيط يلي على يمين باب المفروشات 
		// Furniture Store
		{Point(150.353,84.2594,-216.69),Point(155.638,110.174,-184.188)},// الحيط الامامي يلي فوق الباب 
	    {Point(149.029,65.9284,-182.904),Point(156.2,109.611,-17.225)},// الحيط الامامي لمحل المفروشات
	    {Point(154,60.9386,-215.393),Point(201.98,63.7939,-17.4412)},// ارضية محل المفروشات 
		{Point(154.081,63.9234,-218.526),Point(202.393,109.872,-211.429)}, // الحيط الجانبي اليساري لمحل المفروشات 
		{Point(153.39, 64.1179, -20.0), Point(200.839, 110.67, -15.0)},//الحيط الجانبي اليميني لمحل المفروشات 
		{Point(201.115,66.159,-214.392),Point(213.045,111.7,-17.4738)},// الحيط الحلفي لمحل المفروشات
		{Point(157.294,109.818,-214.427),Point(213.825,113.99,-19.2851)},// الحيط العلوي لمحل المفروشات 
		{Point(152.85,10.7308,-198.408),Point(155.024,59.6898,-33.1319)},//الحيط الامامي يلي بين القهوة والمطعم
		{Point(152.339,11.6413,-226.996),Point(202.545,58.951,-214.098)},//الحيط اليساري للمطعم
		{Point(152.339,11.6413,-226.996),Point(213.292,107.733,-212.523)},//الحيط اليساري للمطعم
		{Point(202.712,11.2172,-214.531),Point(206.958,59.8031,-15.9319)},//الحيط الخلفي للقهوة والمطعم
		{Point(155.447,10.9828,-127.671),Point(202.486,58.91,-98.9376)},//الحيط الجانبي يلي بين القهوة والمطعم
		{Point(178.986,11.1494,-186.543),Point(202.597,21.7033,-168.764)},//الطاولة التانية يلي بالمطعم
		{Point(177.485,11.8957,-211.941),Point(202.304,27.085,-194.964)},//الطاولة الأولى يلي بالمطعم
		{Point(152.288,60.7939,-214.158),Point(204.297,61.5689,-115.8)},//السقف تبع المطعم
		{Point(154.241,8.84553,-215.287),Point(202.567,11.5747,-127.998)},//الأرضية تبع المطعم 
		{Point(156.083,9.3674,-98.3077),Point(201.592,11.7341,-18.1637)},//الأرضية تبع القهوة
		{Point(128.231,14.0543,-18.6829),Point(204.015,112.668,-8.2248)},//الحيط اليساري للقهوة مع الحيط اليميني للمول 
		{Point(151.766,35.8452,-32.5091),Point(155.04,59.2969,-16.4593)},//الحيط يلي فوق باب القهوة
		{Point(151.011,34.8764,-215.352),Point(156.176,59.3207,-196.408)},//الحيط يلي فوق باب المطعم
		{Point(155.064,10.6455,-158.305),Point(191.547,25.6861,-147.865)},//الحيط يلي جوا المطعم
		{Point(172.641,12.0636,-80.9752),Point(182.166,27.7222,-52.5672)},//الطاولة يلي بالقهوة جنب البراد
		{Point(155.088,11.3802,-53.96),Point(176.061,25.9976,-48.1549)},//الطاولة يلي بالقهوة جنب البراد
		{Point(155.026,13.2252,-73.2753),Point(163.99,36.9216,-50.8852)},//البراد يلي بالقهوة 
		{Point(173.789,11.9664,-24.5818),Point(202.478,30.2351,-19.0607)},//الطاولات الجانبية يلي بالقهوة
		{Point(186.888,11.8883,-87.5818),Point(202.478,30.2351,-19.0607)},//الطاولات الجانبية يلي بالقهوة
		{Point(155.121,11.3071,-99.0372),Point(184.842,26.5823,-85.2615)},//الطاولات الجانبية يلي بالقهوة 



		// Electronic Department
		// front wall
		{Point(55, 61.3, -215),Point(59, 112, -168)},// right of the right door
		{Point(55, 82, -168),Point(59, 112, -158)},// above of the right door
		{Point(55, 61.3, -158),Point(59, 112, -102)},// between the right door and the middle door
		{Point(55, 82, -102),Point(59, 112, -92)},// above of the middle door
		{Point(55, 61.3, -92),Point(59, 112, -36)},// between the left door and the middle door
		{Point(55, 82, -36),Point(59, 112, -26)},// above of the middle door
		{Point(55, 61.3, -26),Point(59, 112, -14)},// left of the left door

		// right wall
		{Point(0, 61.3, -218),Point(51.5, 112, -214)},

		// tech store
		{Point(40, 53, -70),Point(59, 88, -45)},	// office
		{Point(15, 60, -69),Point(33, 80, -31)},	// laptops table

		// counter strike		
		{Point(45, 61.3, -150),Point(59, 80, -106)},// right table
		{Point(3, 61.3, -150),Point(16, 80, -106)}, // left table
		{Point(22, 61.3, -150),Point(39, 80, -106)},// middle table
		{Point(3, 61.3, -100),Point(30, 88, -80)},  // office

		// mobile store
		{Point(3, 61.3, -167),Point(30, 88, -147)},  // office
		{Point(3, 61.3, -208),Point(18, 85, -175)},  // cabinet



		// Super Market
		{Point(153.168,64.2826,-25.4147),Point(200.873,107.794,-19.3656)},//الخزانتين يلي بمحل المفروشات 
		{Point(156.13,64.1078,-99.0863),Point(166.372,81.8739,-74.1964)},//التخت الاول بمحل المفروشات 
		{Point(155.19,64.3688,-61.3697),Point(167.49,80.9159,-36.3961)},//التخت التاني بمحل المفروشات 
		{Point(178.672,63.8098,-67.7916),Point(200.903,76.996,-54.1857)},//التخت التالت لمحل المفروشات 
		{Point(181.229,64.0614,-47.4811),Point(200.862,81.6397,-34.1442)},//التخت الرابع لمحل المفروشات 
		{Point(191.675,64.2714,-53.4247),Point(200.834,103.098,-44.5852)},//الخزانة يلي بين التختين بمحل المفروشات 
		{Point(171.979,64.4425,-139.511),Point(198.102,80.5622,-112.564)},//الطاولة الاولى بمحل المفروشات 
		{Point(167.875,64.1664,-177.773),Point(200.679,80.4744,-143.074)},//الطاولة التانية بمحل المفروشات 
		{Point(175.489,63.8681,-79.9853),Point(197.312,73.2365,-71.1635)},//الكنباية الاولى بمحل المفروشات  
		{Point(192.039,64.1682,-100.517),Point(200.438,75.2815,-80.3489)},// الكنباية التانية بمحل المفروشات 
		{Point(180.808,63.9368,-97.4323),Point(193.137,68.4529,-86.4943)},//الطاولة يلي بين  الكنبايات بمحل المفروشات 
		{Point(170.728,64.2253,-111.163),Point(191.777,70.6003,-103.104)},//الكنباية التالتة بمحل المفروشات
		{Point(170.728,64.2253,-111.163),Point(180.315,70.9845,-93.2094)},//الجزء الثاني من الكنباية التالتة بمحل المفروشات 
		{Point(186.933,64.2002,-211.132),Point(196.932,71.0872,-188.446)},//طاولة المكتب لمحل المفروشات 
		{Point(74.2813,12.1597,-141.5),Point(135.501,35.9093,-78.6618)},//البحرة يلي بنص المول 
		{Point(151.009,11.4971,-287.341),Point(181.163,111.046,-255.387)},//الاسطوانة يلي بنص الدرج 
		{Point(52.7677,11.5788,-174.795),Point(60.3496,59.8955,-33.4601)},//الحيط الامامي للسوبر ماركت 
		{Point(44.8977,12.4542,-174.524),Point(34.4068,39.9481,-128.294)},//الحيط الاول بالسوبر ماركت 
		{Point(34.389,11.5218,-174.371),Point(43.5737,46.148,-131.601)},//الحيط التالت بالسوبر ماركت
		{Point(16.757,11.8727,-176.08),Point(27.7557,44.2381,-131.535)},//الحيط الرابع بالسوبر ماركت
		{Point(19.1565,12.7971,-114.894),Point(40.7917,46.0346,-90.727)},//الحيط الخامس للسوبر ماركت
		{Point(17.5485,11.4265,-75.2477),Point(25.736,44.2726,-31.2057)},//الحيط السادس للسوبر ماركت 
		{Point(34.5161,12.8471,-74.0915),Point(43.8931,45.5409,-31.1343)},//الحيط السابع للسوبر ماركت 
		{Point(8.41676,12.7003,-173.703),Point(14.3635,44.4905,-19.0624)},//الحيط التامن للسوبر ماركت 
		{Point(11.6997,11.0405,-199.479),Point(36.7005,29.3031,-183.67)},//طاولة المكتب للسوبر ماركت 
		{Point(11.2124,11.1713,-213.394),Point(27.1967,36.0696,-201.354)},//الكرسي يلي عند المكتب للسوبر ماركت 
		{Point(12.6135,29.3368,-197.144),Point(25.8804,36.6616,-188.679)},//الشاشة يلي عالمكتب بالسوبر ماركت 
		{Point(4.88204,13.6389,-216.982),Point(56.8092,59.6004,-212.913)},//الحيط الجانبي يلي ورا المكتب للسوبر ماركت
		{Point(3.6355,14.3441,-19.0374),Point(58.3792,61.1089,-11.9951)},//الحيط اليميني الجانبي للسوبر ماركت 
		{Point(6.85132,10.8191,-215.322),Point(11.1793,56.8432,-19.2718)},//الحيط الخلفي للسوبر ماركت 
		{Point(14.541,7.63813,-218.973),Point(57.8802,11.8799,-16.1323)},//الارضية الخاصة بالسوبر ماركت 
		{Point(9.73541,58.2729,-212.35),Point(56.3983,64.3014,-18.6705)},//السقف الخاص بالسوبر ماركت 
		{Point(55.7785,41.1389,-31.7273),Point(58.3928,51.3859,-17.9752)},//الارمة يلي فوق باب محل السوبر ماركت 
		{Point(1.02257,13.0446,-19.8155),Point(87.6734,119.718,-11.4407)},//الحيط اليساري الامامي للمول 
		{Point(127.753,10.6884,-17.4133),Point(208.549,119.484,-10.3393)},//الحيط اليميني الامامي للمول 
		{Point(86.3263,40.1158,-20.2553),Point(121.291,120.515,-7.62924)},//الحيط الامامي يلي فوق باب المول
		{Point(4.96298,61.0225,-216),Point(153.072,64.0982,-134.202)},//الارضية تبع الطابق الاول 
		{Point(4.80077,61.9887,-134.944),Point(71.4222,64.3668,-83.8232)},//الارضية تبع الطابق الاول 
		{Point(125.891,59.7761,-133.629),Point(150.057,63.0196,-82.6178)},//الارضية تبع الطابق الاول 
		{Point(4.81668,60.8955,-83.9882),Point(151.094,62.765,-18.8154)},//الارضية تبع الطابق الاول 
		{Point(0.959019,13.4569,-318.188),Point(8.51962,109.422,-21.6073)},//الحيط الجانبي اليساري للمول 
		{Point(202.768,13.6396,-313.362),Point(209.595,112.749,-12.7177)},//الحيط الجانبي اليميني للمول 
		{Point(9.50252,111.716,-311.718),Point(205.809,119.637,-15.1885)},//السقف تبع المول 
		{Point(6.47711,13.7324,-318.563),Point(202.487,111.605,-312.99)},//الحيط الخلفي للمول 
	};
	Elevator elevator;

private:
	float m_x, m_y, m_z;   // Position
	float m_lx, m_ly, m_lz; // Direction vector of where we are looking at
	float m_yaw, m_pitch; // Various rotation angles
	float m_strafe_lx, m_strafe_lz; // Always 90 degree to direction vector
};

#endif
